{
  "token2id": {
    "<pad>": 0,
    "<sos>": 1,
    "<eos>": 2,
    "<unk>": 3,
    "}": 4,
    "{": 5,
    "_": 6,
    "^": 7,
    "(": 8,
    ")": 9,
    "2": 10,
    "1": 11,
    "-": 12,
    "=": 13,
    ",": 14,
    "+": 15,
    "\\frac": 16,
    "a": 17,
    "i": 18,
    "0": 19,
    "r": 20,
    "x": 21,
    "n": 22,
    ".": 23,
    "d": 24,
    "\\,": 25,
    "\\mu": 26,
    "\\left": 27,
    "\\right": 28,
    "e": 29,
    "k": 30,
    "c": 31,
    "m": 32,
    "p": 33,
    "y": 34,
    "3": 35,
    "t": 36,
    "\\alpha": 37,
    "\\partial": 38,
    "~": 39,
    "l": 40,
    "A": 41,
    "s": 42,
    "&": 43,
    "4": 44,
    "j": 45,
    "\\;": 46,
    "g": 47,
    "\\prime": 48,
    "]": 49,
    "[": 50,
    "\\nu": 51,
    "z": 52,
    "\\pi": 53,
    "|": 54,
    "\\ ": 55,
    "b": 56,
    "\\phi": 57,
    "\\\\": 58,
    "\\mathrm": 59,
    "q": 60,
    "\\operatorname": 61,
    "\\cal": 62,
    "N": 63,
    "\\delta": 64,
    "f": 65,
    "\\lambda": 66,
    "\\beta": 67,
    "\\bar": 68,
    "T": 69,
    "\\int": 70,
    "R": 71,
    "D": 72,
    "S": 73,
    "M": 74,
    "L": 75,
    "B": 76,
    "\\sigma": 77,
    "F": 78,
    "\\theta": 79,
    "/": 80,
    "\\gamma": 81,
    "h": 82,
    "\\hat": 83,
    "\\psi": 84,
    "\\sqrt": 85,
    "u": 86,
    "\\sum": 87,
    "H": 88,
    "\\rho": 89,
    "o": 90,
    "\\tilde": 91,
    "\\tau": 92,
    "C": 93,
    "P": 94,
    "G": 95,
    "V": 96,
    "I": 97,
    "X": 98,
    "\\omega": 99,
    "\\epsilon": 100,
    "E": 101,
    "J": 102,
    "\\bf": 103,
    "\\eta": 104,
    "v": 105,
    "\\xi": 106,
    "Q": 107,
    "\\Phi": 108,
    "\\quad": 109,
    "*": 110,
    "5": 111,
    "\\vec": 112,
    "\\{": 113,
    "\\begin": 114,
    "\\end": 115,
    "\\Gamma": 116,
    "K": 117,
    "\\infty": 118,
    "\\}": 119,
    "6": 120,
    "U": 121,
    "\\rangle": 122,
    "\\dot": 123,
    "W": 124,
    "\\pm": 125,
    "\\Lambda": 126,
    "Z": 127,
    "\\varphi": 128,
    "\\Delta": 129,
    "w": 130,
    "\\chi": 131,
    ";": 132,
    "8": 133,
    "\\!": 134,
    "\\Omega": 135,
    "\\kappa": 136,
    "\\qquad": 137,
    "\\cdot": 138,
    "\\Psi": 139,
    "\\equiv": 140,
    "\\langle": 141,
    "\\overline": 142,
    ">": 143,
    "<": 144,
    "\\dagger": 145,
    "\\zeta": 146,
    "\\varepsilon": 147,
    "\\cdots": 148,
    "\\rightarrow": 149,
    "O": 150,
    "\\nabla": 151,
    "Y": 152,
    "\\ldots": 153,
    ":": 154,
    "\\Sigma": 155,
    "\\ell": 156,
    "7": 157,
    "\\mathcal": 158,
    "\\:": 159,
    "!": 160,
    "\\otimes": 161,
    "\\prod": 162,
    "\\wedge": 163,
    "9": 164,
    "\\hspace": 165,
    "\\Pi": 166,
    "\\hbar": 167,
    "\\sim": 168,
    "\\vert": 169,
    "\\in": 170,
    "\\Big": 171,
    "\\widetilde": 172,
    "\\displaystyle": 173,
    "\\times": 174,
    "\\Theta": 175,
    "\\underline": 176,
    "\\mid": 177,
    "\\to": 178,
    "\\dots": 179,
    "\\mathbf": 180,
    "\\ast": 181,
    "\\leq": 182,
    "\\approx": 183,
    "\\star": 184,
    "\\stackrel": 185,
    "\\perp": 186,
    "\\widehat": 187,
    "\\big": 188,
    "\\vartheta": 189,
    "'": 190,
    "\\Bigr": 191,
    "\\geq": 192,
    "\\mp": 193,
    "\\Bigl": 194,
    "\\dag": 195,
    "\\neq": 196,
    "\\simeq": 197,
    "\\textstyle": 198,
    "\\circ": 199,
    "\\bigg": 200,
    "\\biggl": 201,
    "\\biggr": 202,
    "\\oint": 203,
    "\\longrightarrow": 204,
    "\\not": 205,
    "\\boldmath": 206,
    "\\bigr": 207,
    "\\ddot": 208,
    "\\bigl": 209,
    "\\oplus": 210,
    "\\put": 211,
    "\\nonumber": 212,
    "\\Xi": 213,
    "\\|": 214,
    "\\le": 215,
    "\\check": 216,
    "\\propto": 217,
    "\\triangle": 218,
    "\\hline": 219,
    "\\varrho": 220,
    "\\vdots": 221,
    "\\ge": 222,
    "\\imath": 223,
    "\\Bigg": 224,
    "\\sp": 225,
    "\\leftrightarrow": 226,
    "\\forall": 227,
    "\\iota": 228,
    "\\scriptscriptstyle": 229,
    "\\bot": 230,
    "\\lbrack": 231,
    "\\line": 232,
    "\\parallel": 233,
    "\\textrm": 234,
    "\\scriptsize": 235,
    "\\it": 236,
    "\\Rightarrow": 237,
    "\\phantom": 238,
    "\\mapsto": 239,
    "\\subset": 240,
    "\\sf": 241,
    "\\jmath": 242,
    "\\binom": 243,
    "\\Biggr": 244,
    "\\l": 245,
    "\\Biggl": 246,
    "\\Upsilon": 247,
    "\\d": 248,
    "\\tiny": 249,
    "\\overrightarrow": 250,
    "\\wp": 251,
    "\\scriptstyle": 252,
    "\\ne": 253,
    "\\ll": 254,
    "\\kern": 255,
    "\\bullet": 256,
    "\\downarrow": 257,
    "\\gg": 258,
    "\\atop": 259,
    "\\breve": 260,
    "\\L": 261,
    "\\uparrow": 262,
    "\\cong": 263,
    "\\vee": 264,
    "\\bigoplus": 265,
    "\\": 266,
    "\\o": 267,
    "\\Im": 268,
    "\\small": 269,
    "\\rbrack": 270,
    "\\underbrace": 271,
    "\\makebox": 272,
    "\\sb": 273,
    "\\varpi": 274,
    "\\cap": 275,
    "\\ddots": 276,
    "\\mathsf": 277,
    "\\cup": 278,
    "\\lbrace": 279,
    "\\rbrace": 280,
    "\\slash": 281,
    "\\upsilon": 282,
    "\\#": 283,
    "\\Re": 284,
    "\\Longrightarrow": 285,
    "\\vspace": 286,
    "\\acute": 287,
    "\\mit": 288,
    "\\rightharpoonup": 289,
    "\\supset": 290,
    "\\raisebox": 291,
    "\\varsigma": 292,
    "\\Leftrightarrow": 293,
    "\\noalign": 294,
    "\\S": 295,
    "\\longleftrightarrow": 296,
    "\\large": 297,
    "\\circle": 298,
    "\\bigtriangleup": 299,
    "\\O": 300,
    "\\null": 301,
    "\\Large": 302,
    "\\footnotesize": 303,
    "\"": 304,
    "\\raise": 305,
    "\\vphantom": 306,
    "\\_": 307,
    "\\i": 308,
    "\\leftarrow": 309,
    "\\protect": 310,
    "\\Vert": 311,
    "\\llap": 312,
    "\\buildrel": 313,
    "\\Longleftrightarrow": 314,
    "\\enspace": 315,
    "\\overleftarrow": 316,
    "\\sl": 317,
    "`": 318,
    "\\diamond": 319,
    "\\hfill": 320,
    "\\rfloor": 321,
    "\\P": 322,
    "\\bigotimes": 323,
    "\\doteq": 324,
    "\\tt": 325,
    "\\cdotp": 326,
    "\\textbf": 327,
    "\\unitlength": 328,
    "\\emptyset": 329,
    "\\mathop": 330,
    "\\fbox": 331,
    "\\ref": 332,
    "\\aleph": 333,
    "\\backslash": 334,
    "\\-": 335,
    "\\label": 336,
    "\\sharp": 337,
    "\\longmapsto": 338,
    "\\overbrace": 339,
    "\\relax": 340,
    "\\subseteq": 341,
    "\\textup": 342,
    "\\mathit": 343,
    "\\flat": 344,
    "\\vskip": 345,
    "\\bigcup": 346,
    "\\c": 347,
    "\\ni": 348,
    "\\odot": 349,
    "\\setlength": 350,
    "\\/": 351,
    "\\colon": 352,
    "\\strut": 353,
    "\\thinspace": 354,
    "\\bigwedge": 355,
    "\\lfloor": 356,
    "\\smallskip": 357,
    "\\pounds": 358,
    "\\ominus": 359,
    "\\land": 360,
    "\\longleftarrow": 361,
    "\\bmod": 362,
    "\\*": 363,
    "\\bigtriangledown": 364,
    "\\medskip": 365,
    "\\multicolumn": 366,
    "\\arraystretch": 367,
    "\\enskip": 368,
    "\\framebox": 369,
    "\\hookrightarrow": 370,
    "\\hrule": 371,
    "\\parbox": 372,
    "\\vline": 373,
    "\\vrule": 374,
    "?": 375,
    "\\renewcommand": 376,
    "\\setminus": 377,
    "\\b": 378,
    "\\bigcap": 379,
    "\\hfil": 380,
    "\\j": 381,
    "\\lower": 382,
    "\\natural": 383,
    "\\rlap": 384,
    "\\diamondsuit": 385,
    "\\space": 386,
    "\\textit": 387,
    "\\vector": 388,
    "\\ddagger": 389,
    "\\pmod": 390,
    "\\texttt": 391,
    "\\thicklines": 392,
    "\\top": 393,
    "\\LARGE": 394,
    "\\sc": 395,
    "\\smash": 396,
    "\\triangleright": 397,
    "\\&": 398,
    "\\Downarrow": 399,
    "\\bigcirc": 400,
    "\\bigm": 401,
    "\\exists": 402,
    "\\searrow": 403,
    "\\surd": 404,
    "\\vdash": 405,
    "\\arraycolsep": 406,
    "\\hphantom": 407,
    "\\normalsize": 408,
    "\\oval": 409,
    "\\special": 410,
    "\\sqcup": 411,
    "\\textnormal": 412,
    "14": 413,
    "\\Huge": 414,
    "\\[": 415,
    "\\]": 416,
    "\\cite": 417,
    "\\lefteqn": 418,
    "\\mathbin": 419,
    "\\mathrel": 420,
    "\\mkern": 421,
    "\\'": 422,
    "\\AA": 423,
    "\\Biggm": 424,
    "\\footnote": 425,
    "\\itshape": 426,
    "\\lceil": 427,
    "\\m": 428,
    "\\multiput": 429,
    "\\sqcap": 430,
    "\\supseteq": 431,
    "\\textsf": 432,
    "\\unboldmath": 433,
    "16": 434,
    "@": 435,
    "\\(": 436,
    "\\)": 437,
    "\\Bigm": 438,
    "\\Longleftarrow": 439,
    "\\ae": 440,
    "\\amalg": 441,
    "\\asymp": 442,
    "\\crcr": 443,
    "\\do": 444,
    "\\ensuremath": 445,
    "\\hskip": 446,
    "\\linethickness": 447,
    "\\mathclose": 448,
    "\\mathopen": 449,
    "\\nulldelimiterspace": 450,
    "\\ooalign": 451,
    "\\prec": 452,
    "\\qbezier": 453,
    "\\ss": 454,
    "\\triangleleft": 455,
    "\\bigskip": 456,
    "\\bigsqcup": 457,
    "\\ddag": 458,
    "\\fboxsep": 459,
    "\\grave": 460,
    "\\lgroup": 461,
    "\\mathord": 462,
    "\\mathtt": 463,
    "\\nearrow": 464,
    "\\notin": 465,
    "\\oslash": 466,
    "\\preceq": 467,
    "\\protectu": 468,
    "\\rgroup": 469,
    "\\rightleftharpoons": 470,
    "\\setcounter": 471,
    "\\skew": 472,
    "\\smallint": 473,
    "\\smile": 474,
    "\\succ": 475,
    "\\succeq": 476,
    "\\swarrow": 477,
    "\\vcenter": 478,
    "\\vss": 479,
    "\\SS": 480,
    "\\arrowvert": 481,
    "\\atopwithdelims": 482,
    "\\cline": 483,
    "\\em": 484,
    "\\footnotemark": 485,
    "\\hss": 486,
    "\\lq": 487,
    "\\mathnormal": 488,
    "\\mathstrut": 489,
    "\\mathversion": 490,
    "\\mskip": 491,
    "\\nolinebreak": 492,
    "\\ointop": 493,
    "\\rightarrowfill": 494,
    "\\symbol": 495,
    "\\tabcolsep": 496,
    "\\verb": 497,
    "#": 498,
    "10": 499,
    "20": 500,
    "23": 501,
    "25": 502,
    "\\\"": 503,
    "\\^": 504,
    "\\biggm": 505,
    "\\bigvee": 506,
    "\\brace": 507,
    "\\brack": 508,
    "\\coprod": 509,
    "\\def": 510,
    "\\dotfill": 511,
    "\\emph": 512,
    "\\everymath": 513,
    "\\expandafter": 514,
    "\\fill": 515,
    "\\huge": 516,
    "\\leavevmode": 517,
    "\\mathaccent": 518,
    "\\newcommand": 519,
    "\\of": 520,
    "\\overwithdelims": 521,
    "\\protectE": 522,
    "\\protectZ": 523,
    "\\protecte": 524,
    "\\protectm": 525,
    "\\rceil": 526,
    "\\romannumeral": 527,
    "\\root": 528,
    "\\scshape": 529,
    "\\textcircled": 530,
    "\\uppercase": 531
  },
  "pad_token": "<pad>",
  "start_token": "<sos>",
  "end_token": "<eos>",
  "unk_token": "<unk>"
}